[
  {
    "title": "Offload data transfer engine for a block data transfer interface",
    "summary": "In one embodiment, a block data transfer interface employing offload data transfer engine in accordance with the present description includes an offload data transfer engine executing a data transfer command set to transfer a block of data in a transfer data path from a source memory to a new region of a destination memory, wherein the transfer data path bypasses a central processing unit to minimize or reduce involvement of the central processing unit in the block transfer. In response to a successful transfer indication, a logical address is re-mapped to a physical address of the new region of the destination memory, instead of a physical address of the original region of the destination memory. In one embodiment, the re-mapping is performed by a central processing unit. In another embodiment, the re-mapping is performed by the offload data transfer engine. Other aspects are described herein.",
    "number": "10157142",
    "status": "granted",
    "office": {
      "name": "United States Patent and Trademark Office (USPTO)"
    },
    "inventors": [
      {
        "name": "Sivakumar Radhakrishnan"
      },
      {
        "name": "Vishal Verma"
      },
      {
        "name": "Chet R. Douglas"
      },
      {
        "name": "Ashok Raj"
      },
      {
        "name": "Narayan Ranganathan"
      },
      {
        "name": "Dan Williams"
      }
    ],
    "date": {
      "year": 2018,
      "month": 12,
      "day": 18
    },
    "url": "https://patents.google.com/patent/US10157142",
    "assignees": [
      {
        "name": "Intel Corporation"
      }
    ]
  },
  {
    "title": "Apparatus and method for system physical address to memory module address translation",
    "summary": "An apparatus and method are described for system physical address to memory module address translation. For example, one embodiment of an apparatus comprises: a fetch circuit of a core to fetch a system physical address (SPA) translate instruction from memory; a decode circuit of the core to decode the SPA translate instruction; a first register to store an SPA associated with the SPA translate instruction; a memory controller comprising one or more channel controllers to initiate a translation using the SPA, the memory controller to transmit a translation request to a first channel controller; the first channel controller to synthesize a response including dual in-line memory module (DIMM) address information; and a second register to store the DIMM address information to be used to identify the DIMM during subsequent memory transactions.",
    "number": "10162761",
    "status": "granted",
    "office": {
      "name": "United States Patent and Trademark Office (USPTO)"
    },
    "inventors": [
      {
        "name": "Mohan J. Kumar"
      },
      {
        "name": "Sarathy Jayakumar"
      },
      {
        "name": "Ashok Raj"
      },
      {
        "name": "Theodros Yigzaw"
      },
      {
        "name": "Ronald N. Story"
      },
      {
        "name": "Sreenivas Mandava"
      }
    ],
    "date": {
      "year": 2018,
      "month": 12,
      "day": 25
    },
    "url": "https://patents.google.com/patent/US10162761",
    "assignees": [
      {
        "name": "Intel Corporation"
      }
    ]
  },
  {
    "title": "Handling of error prone cache line slots of memory side cache of multi-level system memory",
    "summary": "An apparatus is described that includes memory controller logic circuitry to interface with a memory side cache of a multi-level system memory. The memory controller logic circuitry includes error tracking circuitry to track errors of cache line slots in the memory side cache. The memory controller logic circuitry also comprises faulty list circuitry to store identifiers of faulty cache line slots that are deemed to be excessively error prone. The memory controller logic circuitry is to declare a miss in the memory side cache for requests that map to cache line slots identified in the faulty list.",
    "number": "10185619",
    "status": "granted",
    "office": {
      "name": "United States Patent and Trademark Office (USPTO)"
    },
    "inventors": [
      {
        "name": "Mohan J. Kumar"
      },
      {
        "name": "Robert C. Swanson"
      },
      {
        "name": "Ashok Raj"
      },
      {
        "name": "Theodros Yigzaw"
      }
    ],
    "date": {
      "year": 2019,
      "month": 1,
      "day": 22
    },
    "url": "https://patents.google.com/patent/US10185619",
    "assignees": [
      {
        "name": "Intel Corporation"
      }
    ]
  },
  {
    "title": "Instruction and logic to expose error domain topology to facilitate failure isolation in a processor",
    "summary": "A processor includes an instruction decoder to receive an instruction to perform a machine check operation, the instruction having a first operand and a second operand. The processor further includes a machine check logic coupled to the instruction decoder to determine that the instruction is to determine a type of a machine check bank based on a command value stored in a first storage location indicated by the first operand, to determine a type of a machine check bank identified by a machine check bank identifier (ID) stored in a second storage location indicated by the second operand, and to store the determined type of the machine check bank in the first storage location indicated by the first operand.",
    "number": "10223187",
    "status": "granted",
    "office": {
      "name": "United States Patent and Trademark Office (USPTO)"
    },
    "inventors": [
      {
        "name": "Vincent J. Zimmer"
      },
      {
        "name": "Mohan J. Kumar"
      },
      {
        "name": "Ashok Raj"
      },
      {
        "name": "Narayan Ranganathan"
      }
    ],
    "date": {
      "year": 2019,
      "month": 3,
      "day": 5
    },
    "url": "https://patents.google.com/patent/US10223187",
    "assignees": [
      {
        "name": "Intel Corporation"
      }
    ]
  },
  {
    "title": "Read from memory instructions, processors, methods, and systems, that do not take exception on defective data",
    "summary": "A processor of an aspect includes a decode unit to decode a read from memory instruction. The read from memory instruction is to indicate a source memory operand and a destination storage location. The processor also includes an execution unit coupled with the decode unit. The execution unit, in response to the read from memory instruction, is to read data from the source memory operand, store an indication of defective data in an architecturally visible storage location, when the data is defective, and complete execution of the read from memory instruction without causing an exceptional condition, when the data is defective. Other processors, methods, systems, and instructions are disclosed.",
    "number": "10296416",
    "status": "granted",
    "office": {
      "name": "United States Patent and Trademark Office (USPTO)"
    },
    "inventors": [
      {
        "name": "Hisham Shafi"
      },
      {
        "name": "Mohan J. Kumar"
      },
      {
        "name": "Sarathy Jayakumar"
      },
      {
        "name": "Ron Gabor"
      },
      {
        "name": "Sergiu D. Ghetie"
      },
      {
        "name": "Ashok Raj"
      },
      {
        "name": "Theodros Yigzaw"
      },
      {
        "name": "Neeraj Upasani"
      }
    ],
    "date": {
      "year": 2019,
      "month": 5,
      "day": 21
    },
    "url": "https://patents.google.com/patent/US10296416",
    "assignees": [
      {
        "name": "Intel Corporation"
      }
    ]
  },
  {
    "title": "Enabling error status and reporting in a machine check architecture",
    "summary": "In accordance with implementations disclosed herein, there is provided systems and methods for enabling error status and reporting in a machine check environment. A processing device includes an error status register and an error status component communicably coupled to the error status register. The error status component determines that a machine check error (MCE) is a first correctable error (CE) and sets a first error status corresponding to the first CE in the error status register based on a threshold value. The threshold value is based on a type of the first CE.",
    "number": "10318368",
    "status": "granted",
    "office": {
      "name": "United States Patent and Trademark Office (USPTO)"
    },
    "inventors": [
      {
        "name": "Ashok Raj"
      },
      {
        "name": "Theodros Yigzaw"
      }
    ],
    "date": {
      "year": 2019,
      "month": 6,
      "day": 11
    },
    "url": "https://patents.google.com/patent/US10318368",
    "assignees": [
      {
        "name": "Intel Corporation"
      }
    ]
  },
  {
    "title": "Hardware apparatuses and methods to check data storage devices for transient faults",
    "summary": "Methods and apparatuses relating to a hardware memory test unit to check a section of a data storage device for a transient fault before the data is stored in and/or loaded from the section of the data storage device are described. In one embodiment, an integrated circuit includes a hardware processor to operate on data in a section of a data storage device, and a memory test unit to check the section of the data storage device for a transient fault before the data is stored in the section of the data storage device, wherein the transient fault is to cause a machine check exception if accessed by the hardware processor.",
    "number": "10319458",
    "status": "granted",
    "office": {
      "name": "United States Patent and Trademark Office (USPTO)"
    },
    "inventors": [
      {
        "name": "Hisham Shafi"
      },
      {
        "name": "Mohan J. Kumar"
      },
      {
        "name": "Ron Gabor"
      },
      {
        "name": "Ashok Raj"
      },
      {
        "name": "Theodros Yigzaw"
      }
    ],
    "date": {
      "year": 2019,
      "month": 6,
      "day": 11
    },
    "url": "https://patents.google.com/patent/US10319458",
    "assignees": [
      {
        "name": "Intel Corporation"
      }
    ]
  },
  {
    "title": "System and method to increase availability in a multi-level memory configuration",
    "summary": "One embodiment provides for a data processing system comprising a multi-level system memory including a first memory level of volatile memory and a second memory level that is larger and slower in comparison with the first memory level. The second memory level includes non-volatile memory and can additionally include volatile memory. The multi-level system memory includes a multi-level memory controller including logic to manage a list of faulty addresses within the multi-level system memory. The multi-level memory controller can manage a list of faulty addresses. The multi-level memory controller is configured to satisfy a request for data stored in the first memory level from the second memory level when the data is stored in an address on the list of faulty addresses.",
    "number": "10324852",
    "status": "granted",
    "office": {
      "name": "United States Patent and Trademark Office (USPTO)"
    },
    "inventors": [
      {
        "name": "Mohan J. Kumar"
      },
      {
        "name": "Robert C. Swanson"
      },
      {
        "name": "Ashok Raj"
      },
      {
        "name": "Theodros Yigzaw"
      }
    ],
    "date": {
      "year": 2019,
      "month": 6,
      "day": 18
    },
    "url": "https://patents.google.com/patent/US10324852",
    "assignees": [
      {
        "name": "Intel Corporation"
      }
    ]
  },
  {
    "title": "Systems and method for dynamic address based mirroring",
    "summary": "A systems and methods for dynamic address based minoring are disclosed. A system may include a processor, comprising a mirror address range register to store data indicating a location and a size of a first portion of a system memory to be mirrored. The processor may further include a memory controller coupled to the mirror address range register and including circuitry to cause a second portion of the system memory to mirror the first portion of the system memory.",
    "number": "10387072",
    "status": "granted",
    "office": {
      "name": "United States Patent and Trademark Office (USPTO)"
    },
    "inventors": [
      {
        "name": "Mohan J. Kumar"
      },
      {
        "name": "Sarathy Jayakumar"
      },
      {
        "name": "Ashok Raj"
      },
      {
        "name": "Ronald N. Story"
      },
      {
        "name": "Hemalatha Gurumoorthy"
      }
    ],
    "date": {
      "year": 2019,
      "month": 8,
      "day": 20
    },
    "url": "https://patents.google.com/patent/US10387072",
    "assignees": [
      {
        "name": "Intel Corporation"
      }
    ]
  },
  {
    "title": "Determine when an error log was created",
    "summary": "A computing system can include a machine check counter (MCC) including a current value. The current value indicates a system reboot resetting hardware of the computing system. The machine check counter includes a model specific register including a counter indicating the current value, the current value to be incremented upon the system reboot.",
    "number": "10430267",
    "status": "granted",
    "office": {
      "name": "United States Patent and Trademark Office (USPTO)"
    },
    "inventors": [
      {
        "name": "Ashok Raj"
      },
      {
        "name": "Narayan Ranganathan"
      }
    ],
    "date": {
      "year": 2019,
      "month": 10,
      "day": 1
    },
    "url": "https://patents.google.com/patent/US10430267",
    "assignees": [
      {
        "name": "Intel Corporation"
      }
    ]
  },
  {
    "title": "Providing dedicated resources for a system management mode of a processor",
    "summary": "In one embodiment, a processor includes a plurality of cores including a first core to be reserved for execution in a protected domain, the first core to be hidden from an operating system. The processor may further include a filter coupled to the plurality of cores, where the filter includes a plurality of fields each associated with one of the plurality of cores to indicate whether an interrupt of the protected domain is to be directed to the corresponding core. Other embodiments are described and claimed.",
    "number": "10474596",
    "status": "granted",
    "office": {
      "name": "United States Patent and Trademark Office (USPTO)"
    },
    "inventors": [
      {
        "name": "Mohan J. Kumar"
      },
      {
        "name": "Sarathy Jayakumar"
      },
      {
        "name": "Sergiu D. Ghetie"
      },
      {
        "name": "Ashok Raj"
      },
      {
        "name": "John G. Holm"
      },
      {
        "name": "Narayan Ranganathan"
      }
    ],
    "date": {
      "year": 2019,
      "month": 11,
      "day": 12
    },
    "url": "https://patents.google.com/patent/US10474596",
    "assignees": [
      {
        "name": "Intel Corporation"
      }
    ]
  },
  {
    "title": "Memory pressure notifier",
    "summary": "Various systems and methods for computer memory management are described herein. A system includes a memory controller to: monitor utilization of a memory device, the memory device used with a memory compression technique; determine that the utilization of the memory device violates a threshold; and initiate a system interrupt to provoke a response, responsive to the utilization of the memory device violating the threshold.",
    "number": "10579551",
    "status": "granted",
    "office": {
      "name": "United States Patent and Trademark Office (USPTO)"
    },
    "inventors": [
      {
        "name": "David Hansen"
      },
      {
        "name": "Alexandre Y. Solomatnikov"
      },
      {
        "name": "Chandan Egbert"
      },
      {
        "name": "Ashok Raj"
      },
      {
        "name": "Ishwar Agarwal"
      },
      {
        "name": "Amin Firoozshahian"
      },
      {
        "name": "Andreas Kleen"
      },
      {
        "name": "Stephen R. Van Doren"
      },
      {
        "name": "Omid Azizi"
      },
      {
        "name": "Mahesh Madhav"
      },
      {
        "name": "Mahesh Maddury"
      }
    ],
    "date": {
      "year": 2020,
      "month": 3,
      "day": 3
    },
    "url": "https://patents.google.com/patent/US10579551",
    "assignees": [
      {
        "name": "Intel Corporation"
      }
    ]
  },
  {
    "title": "Management of processor performance based on user interrupts",
    "summary": "In an embodiment, a processor for performance state adjustment includes a plurality of processing engines (PEs), a power control unit, and an input/output memory management unit (IOMMU). The IOMMU is to determine a destination PE for a user interrupt based on mapping data of the IOMMU, and to send a notification of the user interrupt to the power control unit. The notification indicates the destination PE for the user interrupt. The power control unit is to adjust a performance state of the destination PE in response to the notification of the user interrupt. Other embodiments are described and claimed.",
    "number": "10599596",
    "status": "granted",
    "office": {
      "name": "United States Patent and Trademark Office (USPTO)"
    },
    "inventors": [
      {
        "name": "Ashok Raj"
      },
      {
        "name": "Jacob Pan"
      },
      {
        "name": "Srinivas Pandruvada"
      }
    ],
    "date": {
      "year": 2020,
      "month": 3,
      "day": 24
    },
    "url": "https://patents.google.com/patent/US10599596",
    "assignees": [
      {
        "name": "Intel Corporation"
      }
    ]
  },
  {
    "title": "System, apparatus and method for providing hardware feedback information in a processor",
    "summary": "In one embodiment, a processor includes a plurality of cores to execute instructions, a first identification register having a first field to store a feedback indicator to indicate to an operating system (OS) that the processor is to provide hardware feedback information to the OS dynamically and a power controller coupled to the plurality of cores. The power controller may include a feedback control circuit to dynamically determine the hardware feedback information for at least one of the plurality of cores and inform the OS of an update to the hardware feedback information. Other embodiments are described and claimed.",
    "number": "10620969",
    "status": "granted",
    "office": {
      "name": "United States Patent and Trademark Office (USPTO)"
    },
    "inventors": [
      {
        "name": "Eugene Gorbatov"
      },
      {
        "name": "Avinash N. Ananthakrishnan"
      },
      {
        "name": "Vedvyas Shanbhogue"
      },
      {
        "name": "Russell J. Fenger"
      },
      {
        "name": "Ashok Raj"
      },
      {
        "name": "Kameswar Subramaniam"
      }
    ],
    "date": {
      "year": 2020,
      "month": 4,
      "day": 14
    },
    "url": "https://patents.google.com/patent/US10620969",
    "assignees": [
      {
        "name": "Intel Corporation"
      }
    ]
  },
  {
    "title": "Enforcing unique page table permissions with shared page tables",
    "summary": "A processor includes a processing core; a filter register to store a first permissions filter; and a memory management unit (MMU), coupled to the processing core, the filter register and a first peripheral device associated with the first permissions filter, wherein the MMU comprises a logic circuit to manage a shared page table comprising entries corresponding to the processing core and the first peripheral device, wherein the logic circuit is to; receive a memory access request for a first page of memory from the first peripheral device; determine whether the set of permission bits of the first entry match a first combination of bits of the first permissions filter; grant the memory access request if the set of permission bits match the first combination of bits of the first permissions filter; and cause a page fault if the set of permission bits do not matching the first combination of bits.",
    "number": "10969980",
    "status": "granted",
    "office": {
      "name": "United States Patent and Trademark Office (USPTO)"
    },
    "inventors": [
      {
        "name": "David Hansen"
      },
      {
        "name": "Ashok Raj"
      }
    ],
    "date": {
      "year": 2021,
      "month": 4,
      "day": 6
    },
    "url": "https://patents.google.com/patent/US10969980",
    "assignees": [
      {
        "name": "Intel Corporation"
      }
    ]
  },
  {
    "title": "Network interface for data transport in heterogeneous computing environments",
    "summary": "A network interface controller can be programmed to direct write received data to a memory buffer via either a host-to-device fabric or an accelerator fabric. For packets received that are to be written to a memory buffer associated with an accelerator device, the network interface controller can determine an address translation of a destination memory address of the received packet and determine whether to use a secondary head. If a translated address is available and a secondary head is to be used, a direct memory access (DMA) engine is used to copy a portion of the received packet via the accelerator fabric to a destination memory buffer associated with the address translation. Accordingly, copying a portion of the received packet through the host-to-device fabric and to a destination memory can be avoided and utilization of the host-to-device fabric can be reduced for accelerator bound traffic.",
    "number": "11025544",
    "status": "granted",
    "office": {
      "name": "United States Patent and Trademark Office (USPTO)"
    },
    "inventors": [
      {
        "name": "Rajesh M. Sankaran"
      },
      {
        "name": "Robert O. Sharp"
      },
      {
        "name": "Pratik M. Marolia"
      },
      {
        "name": "Parthasarathy Sarangam"
      },
      {
        "name": "Ashok Raj"
      },
      {
        "name": "Nrupal Jani"
      }
    ],
    "date": {
      "year": 2021,
      "month": 6,
      "day": 1
    },
    "url": "https://patents.google.com/patent/US11025544",
    "assignees": [
      {
        "name": "Intel Corporation"
      }
    ]
  },
  {
    "title": "Apparatus and method to identify the source of an interrupt",
    "summary": "An apparatus and method for processing non-maskable interrupt source information. For example, one embodiment of a processor comprises: a plurality of cores comprising execution circuitry to execute instructions and process data; local interrupt circuitry comprising a plurality of registers to store interrupt-related data including non-maskable interrupt (NMI) data related to a first NMI; and non-maskable interrupt (NMI) processing mode selection circuitry, responsive to a request, to select between at least two NMI processing modes to process the first NMI including: a first NMI processing mode in which the plurality of registers are to store first data related to a first NMI, wherein no NMI source information related to a source of the NMI is included in the first data, and a second NMI processing mode in which the plurality of registers are to store both the first data related to the first NMI and second data comprising NMI source information indicating the NMI source.",
    "number": "11048512",
    "status": "granted",
    "office": {
      "name": "United States Patent and Trademark Office (USPTO)"
    },
    "inventors": [
      {
        "name": "Jason W. Brandt"
      },
      {
        "name": "Gilbert Neiger"
      },
      {
        "name": "Larisa Novakovsky"
      },
      {
        "name": "Sarathy Jayakumar"
      },
      {
        "name": "Ido Ouziel"
      },
      {
        "name": "Ashok Raj"
      },
      {
        "name": "Beeman C. Strong"
      },
      {
        "name": "Rupin H. Vakharwala"
      },
      {
        "name": "Andreas Kleen"
      },
      {
        "name": "Jeff Huxel"
      }
    ],
    "date": {
      "year": 2021,
      "month": 6,
      "day": 29
    },
    "url": "https://patents.google.com/patent/US11048512",
    "assignees": [
      {
        "name": "Intel Corporation"
      }
    ]
  },
  {
    "title": "Read from memory instructions, processors, methods, and systems, that do not take exception on defective data",
    "summary": "A processor of an aspect includes a decode unit to decode a read from memory instruction. The read from memory instruction is to indicate a source memory operand and a destination storage location. The processor also includes an execution unit coupled with the decode unit. The execution unit, in response to the read from memory instruction, is to read data from the source memory operand, store an indication of defective data in an architecturally visible storage location, when the data is defective, and complete execution of the read from memory instruction without causing an exceptional condition, when the data is defective. Other processors, methods, systems, and instructions are disclosed.",
    "number": "11068339",
    "status": "granted",
    "office": {
      "name": "United States Patent and Trademark Office (USPTO)"
    },
    "inventors": [
      {
        "name": "Hisham Shafi"
      },
      {
        "name": "Mohan J. Kumar"
      },
      {
        "name": "Sarathy Jayakumar"
      },
      {
        "name": "Ron Gabor"
      },
      {
        "name": "Sergiu D. Ghetie"
      },
      {
        "name": "Ashok Raj"
      },
      {
        "name": "Theodros Yigzaw"
      },
      {
        "name": "Neeraj Upasani"
      }
    ],
    "date": {
      "year": 2021,
      "month": 7,
      "day": 20
    },
    "url": "https://patents.google.com/patent/US11068339",
    "assignees": [
      {
        "name": "Intel Corporation"
      }
    ]
  },
  {
    "title": "Measuring per-node bandwidth within non-uniform memory access (NUMA) systems",
    "summary": "A computing system includes a plurality of nodes including a first node, the first node including at least one core, a memory controller, a node-track register (MSR), and a monitoring counter array including a plurality of counters. The memory controller is to access a plurality of bits of the node-track MSR to determine a subset of nodes to be tracked, wherein the subset of nodes includes the first node and a second node. The memory controller is further to allocate a first counter of the plurality of counters to track memory requests sent to a local system memory by the first node; and allocate a second counter of the plurality of counters to track a memory response associated with a memory request sent by the first node to the second node.",
    "number": "11093414",
    "status": "granted",
    "office": {
      "name": "United States Patent and Trademark Office (USPTO)"
    },
    "inventors": [
      {
        "name": "Ashok Raj"
      },
      {
        "name": "Yao Jin"
      },
      {
        "name": "Anthony Luck"
      }
    ],
    "date": {
      "year": 2021,
      "month": 8,
      "day": 17
    },
    "url": "https://patents.google.com/patent/US11093414",
    "assignees": [
      {
        "name": "Intel Corporation"
      }
    ]
  },
  {
    "title": "Pause communication from I/O devices supporting page faults",
    "summary": "A processing device includes a core to execute instructions, and memory management circuitry coupled to, memory, the core and an I/O device that supports page faults. The memory management circuitry includes an express invalidations circuitry, and a page translation permission circuitry. The memory management circuitry is to, while the core is executing the instructions, receive a command to pause communication between the I/O device and the memory. In response to receiving the command to pause the communication, modify permissions of page translations by the page translation permission circuitry and transmit an invalidation request, by the express invalidations circuitry to the I/O device, to cause cached page translations in the I/O device to be invalidated.",
    "number": "11169929",
    "status": "granted",
    "office": {
      "name": "United States Patent and Trademark Office (USPTO)"
    },
    "inventors": [
      {
        "name": "Rajesh M. Sankaran"
      },
      {
        "name": "Ashok Raj"
      },
      {
        "name": "Amin Firoozshahian"
      },
      {
        "name": "Rupin H. Vakharwala"
      },
      {
        "name": "Andreas Kleen"
      },
      {
        "name": "Stephen R. Van Doren"
      },
      {
        "name": "Omid Azizi"
      },
      {
        "name": "Mahesh Madhav"
      },
      {
        "name": "Mahesh Maddury"
      }
    ],
    "date": {
      "year": 2021,
      "month": 11,
      "day": 9
    },
    "url": "https://patents.google.com/patent/US11169929",
    "assignees": [
      {
        "name": "Intel Corporation"
      }
    ]
  },
  {
    "title": "Address space identifier management in complex input/output virtualization environments",
    "summary": "Embodiment of this disclosure provides a mechanism to extend a workload instruction to include both untranslated and translated address space identifiers (ASIDs). In one embodiment, a processing device comprising a translation manager is provided. The translation manager receives a workload instruction from a guest application. The workload instruction comprises an untranslated (ASID) and a workload for an input/output (I/O) device. The untranslated ASID is translated to a translated ASID. The translated ASID inserted into a payload of the workload instruction. Thereupon, the payload is provided to a work queue of the I/O device to execute the workload based in part on at least one of: the translated ASID or the untranslated ASID.",
    "number": "11269782",
    "status": "granted",
    "office": {
      "name": "United States Patent and Trademark Office (USPTO)"
    },
    "inventors": [
      {
        "name": "Kun Tian"
      },
      {
        "name": "Rajesh M. Sankaran"
      },
      {
        "name": "Sanjay Kumar"
      },
      {
        "name": "Ashok Raj"
      },
      {
        "name": "Xiao Zheng"
      }
    ],
    "date": {
      "year": 2022,
      "month": 3,
      "day": 8
    },
    "url": "https://patents.google.com/patent/US11269782",
    "assignees": [
      {
        "name": "Intel Corporation"
      }
    ]
  },
  {
    "title": "Hardware unit for reverse translation in a processor",
    "summary": "In an embodiment, a processor for reverse translation includes a plurality of processing engines (PEs) to execute threads and a reverse translation circuit. The reverse translation circuit is to: determine a target module address of a corrupt portion of a memory module; determine a plurality of system physical address (SPA) addresses associated with the memory module; and for each SPA address in the plurality of SPA addresses, translate the SPA address into a translated module address, and in response to a determination that the translated module address matches the target module address, log the SPA address as a result of a reverse translation of the target module address. Other embodiments are described and claimed.",
    "number": "11307996",
    "status": "granted",
    "office": {
      "name": "United States Patent and Trademark Office (USPTO)"
    },
    "inventors": [
      {
        "name": "Sarathy Jayakumar"
      },
      {
        "name": "Wei-Pin Chen"
      },
      {
        "name": "Ashok Raj"
      },
      {
        "name": "Theodros Yigzaw"
      },
      {
        "name": "John G. Holm"
      }
    ],
    "date": {
      "year": 2022,
      "month": 4,
      "day": 19
    },
    "url": "https://patents.google.com/patent/US11307996",
    "assignees": [
      {
        "name": "Intel Corporation"
      }
    ]
  },
  {
    "title": "Process address space identifier virtualization using hardware paging hint",
    "summary": "Process address space identifier virtualization uses hardware paging hint. The processing device (100) comprising: a processing core (110); and a translation circuit coupled to the processing core, the translation circuit to: receive a workload instruction from a guest application being executed by the processing device, the workload instruction comprising an untranslated guest process address space identifier (gPASID), a workload for an input/output (I/O) target device, and an identifier of a submission register on the I/O target device (410), access a paging data structure (PDS) associated with the guest application to retrieve a page table entry corresponding to the gPASID and the identifier of the submission register (420), determine a value of an I/O hint bit of the page table entry corresponding to the gPASID and the identifier of the submission register (430), responsive to determining that the I/O hint bit is enabled, keep the untranslated gPASID in the workload instruction (440), and provide the workload instruction to a work queue of the I/O target device (450).",
    "number": "11461100",
    "status": "granted",
    "office": {
      "name": "United States Patent and Trademark Office (USPTO)"
    },
    "inventors": [
      {
        "name": "Kun Tian"
      },
      {
        "name": "Rajesh M. Sankaran"
      },
      {
        "name": "Sanjay Kumar"
      },
      {
        "name": "Philip R. Lantz"
      },
      {
        "name": "Ashok Raj"
      },
      {
        "name": "Yi-Feng Liu"
      }
    ],
    "date": {
      "year": 2022,
      "month": 10,
      "day": 4
    },
    "url": "https://patents.google.com/patent/US11461100",
    "assignees": [
      {
        "name": "Intel Corporation"
      }
    ]
  },
  {
    "title": "Apparatus and method to identify the source of an interrupt",
    "summary": "An apparatus and method for processing non-maskable interrupt source information. For example, one embodiment of a processor comprises: a plurality of cores comprising execution circuitry to execute instructions and process data; local interrupt circuitry comprising a plurality of registers to store interrupt-related data including non-maskable interrupt (NMI) data related to a first NMI; and non-maskable interrupt (NMI) processing mode selection circuitry, responsive to a request, to select between at least two NMI processing modes to process the first NMI including: a first NMI processing mode in which the plurality of registers are to store first data related to a first NMI, wherein no NMI source information related to a source of the NMI is included in the first data, and a second NMI processing mode in which the plurality of registers are to store both the first data related to the first NMI and second data comprising NMI source information indicating the NMI source.",
    "number": "11614939",
    "status": "granted",
    "office": {
      "name": "United States Patent and Trademark Office (USPTO)"
    },
    "inventors": [
      {
        "name": "Jason W. Brandt"
      },
      {
        "name": "Gilbert Neiger"
      },
      {
        "name": "Larisa Novakovsky"
      },
      {
        "name": "Sarathy Jayakumar"
      },
      {
        "name": "Ido Ouziel"
      },
      {
        "name": "Ashok Raj"
      },
      {
        "name": "Beeman C. Strong"
      },
      {
        "name": "Rupin H. Vakharwala"
      },
      {
        "name": "Andreas Kleen"
      },
      {
        "name": "Jeff Huxel"
      }
    ],
    "date": {
      "year": 2023,
      "month": 3,
      "day": 28
    },
    "url": "https://patents.google.com/patent/US11614939",
    "assignees": [
      {
        "name": "Intel Corporation"
      }
    ]
  },
  {
    "title": "Unified address translation for virtualization of input/output devices",
    "summary": "Embodiments of apparatuses, methods, and systems for unified address translation for virtualization of input/output devices are described. In an embodiment, an apparatus includes first circuitry to use at least an identifier of a device to locate a context entry and second circuitry to use at least a process address space identifier (PASID) to locate a PASID-entry. The context entry is to include at least one of a page-table pointer to a page-table translation structure and a PASID. The PASID-entry is to include at least one of a first-level page-table pointer to a first-level translation structure and a second-level page-table pointer to a second-level translation structure. The PASID is to be supplied by the device. At least one of the apparatus, the context entry, and the PASID entry is to include one or more control fields to indicate whether the first-level page-table pointer or the second-level page-table pointer is to be used.",
    "number": "11698866",
    "status": "granted",
    "office": {
      "name": "United States Patent and Trademark Office (USPTO)"
    },
    "inventors": [
      {
        "name": "Kun Tian"
      },
      {
        "name": "Rajesh M. Sankaran"
      },
      {
        "name": "Sanjay Kumar"
      },
      {
        "name": "Utkarsh Y. Kakaiya"
      },
      {
        "name": "Philip R. Lantz"
      },
      {
        "name": "Ashok Raj"
      }
    ],
    "date": {
      "year": 2023,
      "month": 7,
      "day": 11
    },
    "url": "https://patents.google.com/patent/US11698866",
    "assignees": [
      {
        "name": "Intel Corporation"
      }
    ]
  },
  {
    "title": "Processing device, control unit, electronic device, method for the electronic device, and computer program for the electronic device",
    "summary": "A processing device is provided. The processing device comprises an interface configured to receive information about an operation state of a surrogate processor. Further, the processing device comprises a processing circuitry configured to control the interface and to decide whether an interrupt addressed to the processing circuitry is processed by the processing circuitry or redirected to the surrogate processing circuitry based on an operation state of the processing circuitry and the surrogate processing circuitry.",
    "number": "11740931",
    "status": "granted",
    "office": {
      "name": "United States Patent and Trademark Office (USPTO)"
    },
    "inventors": [
      {
        "name": "Rajesh M. Sankaran"
      },
      {
        "name": "Utkarsh Y. Kakaiya"
      },
      {
        "name": "Ashok Raj"
      }
    ],
    "date": {
      "year": 2023,
      "month": 8,
      "day": 29
    },
    "url": "https://patents.google.com/patent/US11740931",
    "assignees": [
      {
        "name": "Intel Corporation"
      }
    ]
  },
  {
    "title": "Apparatus and method for performance state matching between source and target processors based on interprocessor interrupts",
    "summary": "Apparatus, method, and machine-readable medium to provide performance state matching between source and target processors based on inter-processor interrupts. An exemplary apparatus includes a target processor to execute a receiving task at a first performance level and a source processor to execute a sending task at a second performance level higher than the first performance level. The sending task is to store interrupt routing data indicating a pairing between the sending task and the receiving task into a memory location and that the sending task is to dispatch work to be processed by the receiving task. The apparatus further includes a performance management unit to detect the pairing between the sending task and the receiving task based on the interrupt routing data and responsively adjust the performance level of the target processor from the first performance level to the second performance level based, at least in part, on the pairing.",
    "number": "11775336",
    "status": "granted",
    "office": {
      "name": "United States Patent and Trademark Office (USPTO)"
    },
    "inventors": [
      {
        "name": "Ashok Raj"
      },
      {
        "name": "Jacob Pan"
      },
      {
        "name": "Srinivas Pandruvada"
      }
    ],
    "date": {
      "year": 2023,
      "month": 10,
      "day": 3
    },
    "url": "https://patents.google.com/patent/US11775336",
    "assignees": [
      {
        "name": "Intel Corporation"
      }
    ]
  },
  {
    "title": "Apparatus and method to identify the source of an interrupt",
    "summary": "An apparatus and method for processing non-maskable interrupt source information. For example, one embodiment of a processor comprises: a plurality of cores comprising execution circuitry to execute instructions and process data; local interrupt circuitry comprising a plurality of registers to store interrupt-related data including non-maskable interrupt (NMI) data related to a first NMI; and non-maskable interrupt (NMI) processing mode selection circuitry, responsive to a request, to select between at least two NMI processing modes to process the first NMI including: a first NMI processing mode in which the plurality of registers are to store first data related to a first NMI, wherein no NMI source information related to a source of the NMI is included in the first data, and a second NMI processing mode in which the plurality of registers are to store both the first data related to the first NMI and second data comprising NMI source information indicating the NMI source.",
    "number": "11900115",
    "status": "granted",
    "office": {
      "name": "United States Patent and Trademark Office (USPTO)"
    },
    "inventors": [
      {
        "name": "Jason W. Brandt"
      },
      {
        "name": "Gilbert Neiger"
      },
      {
        "name": "Larisa Novakovsky"
      },
      {
        "name": "Sarathy Jayakumar"
      },
      {
        "name": "Ido Ouziel"
      },
      {
        "name": "Ashok Raj"
      },
      {
        "name": "Beeman C. Strong"
      },
      {
        "name": "Rupin H. Vakharwala"
      },
      {
        "name": "Andreas Kleen"
      },
      {
        "name": "Jeff Huxel"
      }
    ],
    "date": {
      "year": 2024,
      "month": 2,
      "day": 13
    },
    "url": "https://patents.google.com/patent/US11900115",
    "assignees": [
      {
        "name": "Intel Corporation"
      }
    ]
  },
  {
    "title": "Network interface for data transport in heterogeneous computing environments",
    "summary": "A network interface controller can be programmed to direct write received data to a memory buffer via either a host-to-device fabric or an accelerator fabric. For packets received that are to be written to a memory buffer associated with an accelerator device, the network interface controller can determine an address translation of a destination memory address of the received packet and determine whether to use a secondary head. If a translated address is available and a secondary head is to be used, a direct memory access (DMA) engine is used to copy a portion of the received packet via the accelerator fabric to a destination memory buffer associated with the address translation. Accordingly, copying a portion of the received packet through the host-to-device fabric and to a destination memory can be avoided and utilization of the host-to-device fabric can be reduced for accelerator bound traffic.",
    "number": "11929927",
    "status": "granted",
    "office": {
      "name": "United States Patent and Trademark Office (USPTO)"
    },
    "inventors": [
      {
        "name": "Rajesh M. Sankaran"
      },
      {
        "name": "Robert O. Sharp"
      },
      {
        "name": "Pratik M. Marolia"
      },
      {
        "name": "Parthasarathy Sarangam"
      },
      {
        "name": "Ashok Raj"
      },
      {
        "name": "Nrupal Jani"
      }
    ],
    "date": {
      "year": 2024,
      "month": 3,
      "day": 12
    },
    "url": "https://patents.google.com/patent/US11929927",
    "assignees": [
      {
        "name": "Intel Corporation"
      }
    ]
  },
  {
    "title": "Unified address translation for virtualization of input/output devices",
    "summary": "Embodiments of apparatuses, methods, and systems for unified address translation for virtualization of input/output devices are described. In an embodiment, an apparatus includes first circuitry to use at least an identifier of a device to locate a context entry and second circuitry to use at least a process address space identifier (PASID) to locate a PASID-entry. The context entry is to include at least one of a page-table pointer to a page-table translation structure and a PASID. The PASID-entry is to include at least one of a first-level page-table pointer to a first-level translation structure and a second-level page-table pointer to a second-level translation structure. The PASID is to be supplied by the device. At least one of the apparatus, the context entry, and the PASID entry is to include one or more control fields to indicate whether the first-level page-table pointer or the second-level page-table pointer is to be used.",
    "number": "12013790",
    "status": "granted",
    "office": {
      "name": "United States Patent and Trademark Office (USPTO)"
    },
    "inventors": [
      {
        "name": "Kun Tian"
      },
      {
        "name": "Rajesh M. Sankaran"
      },
      {
        "name": "Sanjay Kumar"
      },
      {
        "name": "Utkarsh Y. Kakaiya"
      },
      {
        "name": "Philip R. Lantz"
      },
      {
        "name": "Ashok Raj"
      }
    ],
    "date": {
      "year": 2024,
      "month": 6,
      "day": 18
    },
    "url": "https://patents.google.com/patent/US12013790",
    "assignees": [
      {
        "name": "Intel Corporation"
      }
    ]
  },
  {
    "title": "Device, method, and system to identify a page request to be processed after a reset event",
    "summary": "Techniques and mechanisms for an input-output memory management module (IOMMU) to indicate to software whether a page request by an endpoint device is to be serviced. In an embodiment, the IOMMU receives from the endpoint device a response to an invalidation wait message. Based on the response, the IOMMU provides first information which indicates to software that page requests have been flushed from the endpoint device. Page request message from the endpoint device are compatible with an interface standard which also comprises a stop marker message type. The first information is provided independent of the endpoint device providing any message which is of the stop marker message type. In another embodiment, the first information includes a drain marker generated by the IOMMU, or a snapshot of an address corresponding to an end of a page request queue.",
    "number": "12164444",
    "status": "granted",
    "office": {
      "name": "United States Patent and Trademark Office (USPTO)"
    },
    "inventors": [
      {
        "name": "Rajesh M. Sankaran"
      },
      {
        "name": "Utkarsh Y. Kakaiya"
      },
      {
        "name": "Ashok Raj"
      },
      {
        "name": "Rupin H. Vakharwala"
      }
    ],
    "date": {
      "year": 2024,
      "month": 12,
      "day": 10
    },
    "url": "https://patents.google.com/patent/US12164444",
    "assignees": [
      {
        "name": "Intel Corporation"
      }
    ]
  },
  {
    "title": "Methods and apparatus to perform a pseudo-S3 protocol to update firmware and/or activate new firmware with a warm reset",
    "summary": "Methods, apparatus, systems, and articles of manufacture to perform a pseudo-S3 protocol to update firmware and/or activate new firmware with a warm reset are disclosed. An example apparatus includes an advanced configuration and power interface (ACPI) to: initiate a pseudo-sleep event in response to identifying a firmware update; and assert a power button event, the power button event to cause an operating system (OS) to prepare to enter into a sleep state; a basic input/output system (BIOS) to: initiate a warm reset in response to the OS preparing to enter the sleep state, the warm reset to update firmware according to the firmware update; and transmit a wake vector to the OS to continue operation.",
    "number": "12223308",
    "status": "granted",
    "office": {
      "name": "United States Patent and Trademark Office (USPTO)"
    },
    "inventors": [
      {
        "name": "Mohan J. Kumar"
      },
      {
        "name": "Sarathy Jayakumar"
      },
      {
        "name": "Murugasamy K. Nachimuthu"
      },
      {
        "name": "Ashok Raj"
      },
      {
        "name": "Brett Wang"
      }
    ],
    "date": {
      "year": 2025,
      "month": 2,
      "day": 11
    },
    "url": "https://patents.google.com/patent/US12223308",
    "assignees": [
      {
        "name": "Intel Corporation"
      }
    ]
  },
  {
    "title": "Unified address translation for virtualization of input/output devices",
    "summary": "Embodiments of apparatuses, methods, and systems for unified address translation for virtualization of input/output devices are described. In an embodiment, an apparatus includes first circuitry to use at least an identifier of a device to locate a context entry and second circuitry to use at least a process address space identifier (PASID) to locate a PASID-entry. The context entry is to include at least one of a page-table pointer to a page-table translation structure and a PASID. The PASID-entry is to include at least one of a first-level page-table pointer to a first-level translation structure and a second-level page-table pointer to a second-level translation structure. The PASID is to be supplied by the device. At least one of the apparatus, the context entry, and the PASID entry is to include one or more control fields to indicate whether the first-level page-table pointer or the second-level page-table pointer is to be used.",
    "number": "12326818",
    "status": "granted",
    "office": {
      "name": "United States Patent and Trademark Office (USPTO)"
    },
    "inventors": [
      {
        "name": "Kun Tian"
      },
      {
        "name": "Rajesh M. Sankaran"
      },
      {
        "name": "Sanjay Kumar"
      },
      {
        "name": "Utkarsh Y. Kakaiya"
      },
      {
        "name": "Philip R. Lantz"
      },
      {
        "name": "Ashok Raj"
      }
    ],
    "date": {
      "year": 2025,
      "month": 6,
      "day": 10
    },
    "url": "https://patents.google.com/patent/US12326818",
    "assignees": [
      {
        "name": "Intel Corporation"
      }
    ]
  },
  {
    "title": "Network interface for data transport in heterogeneous computing environments",
    "summary": "A network interface controller can be programmed to direct write received data to a memory buffer via either a host-to-device fabric or an accelerator fabric. For packets received that are to be written to a memory buffer associated with an accelerator device, the network interface controller can determine an address translation of a destination memory address of the received packet and determine whether to use a secondary head. If a translated address is available and a secondary head is to be used, a direct memory access (DMA) engine is used to copy a portion of the received packet via the accelerator fabric to a destination memory buffer associated with the address translation. Accordingly, copying a portion of the received packet through the host-to-device fabric and to a destination memory can be avoided and utilization of the host-to-device fabric can be reduced for accelerator bound traffic.",
    "number": "12335142",
    "status": "granted",
    "office": {
      "name": "United States Patent and Trademark Office (USPTO)"
    },
    "inventors": [
      {
        "name": "Rajesh M. Sankaran"
      },
      {
        "name": "Robert O. Sharp"
      },
      {
        "name": "Pratik M. Marolia"
      },
      {
        "name": "Parthasarathy Sarangam"
      },
      {
        "name": "Ashok Raj"
      },
      {
        "name": "Nrupal Jani"
      }
    ],
    "date": {
      "year": 2025,
      "month": 6,
      "day": 17
    },
    "url": "https://patents.google.com/patent/US12335142",
    "assignees": [
      {
        "name": "Intel Corporation"
      }
    ]
  },
  {
    "title": "Method and computer program for data conversion in a heterogeneous communications network",
    "summary": "A method and computer program for data conversion in a heterogeneous communications network. This method and computer program converts data for computer systems having different data storage architectures so that these computer systems may simply and easily communicate over a network. This is most useful when converting data stored in little endian and big endian format. This method relies on creating the data structure used to convert the data using embedded macros that are not executed at run time. These embedded macros are expanded by the compiler to generate the data structure and thereby saves substantial time during execution.",
    "number": "6772320",
    "status": "granted",
    "office": {
      "name": "United States Patent and Trademark Office (USPTO)"
    },
    "inventors": [
      {
        "name": "Ashok Raj"
      }
    ],
    "date": {
      "year": 2004,
      "month": 8,
      "day": 3
    },
    "url": "https://patents.google.com/patent/US6772320",
    "assignees": [
      {
        "name": "Intel Corporation"
      }
    ]
  },
  {
    "title": "Cluster with multiple paths between hosts and I/O controllers",
    "summary": "A host is coupled to a cluster fabric which includes a fabric-attached I/O controller. The host includes a processor, a memory coupled to the processor and an operating system. The operating system includes a kernel and a fabric bus driver to provide an I/O bus abstraction to the kernel for the cluster fabric to report multiple paths to a target fabric-attached I/O controller.",
    "number": "7039922",
    "status": "granted",
    "office": {
      "name": "United States Patent and Trademark Office (USPTO)"
    },
    "inventors": [
      {
        "name": "Ashok Raj"
      },
      {
        "name": "Rajesh Shah"
      }
    ],
    "date": {
      "year": 2006,
      "month": 5,
      "day": 2
    },
    "url": "https://patents.google.com/patent/US7039922",
    "assignees": [
      {
        "name": "Intel Corporation"
      }
    ]
  },
  {
    "title": "Mechanism for allowing multiple entities on the same host to handle messages of same service class in a cluster",
    "summary": "A mechanism is provided at a host system to allow multiple entities (clients) to send and receive messages of a particular class of management services in a switched fabric for scalable solutions.",
    "number": "7194540",
    "status": "granted",
    "office": {
      "name": "United States Patent and Trademark Office (USPTO)"
    },
    "inventors": [
      {
        "name": "Anil Aggarwal"
      },
      {
        "name": "Ashok Raj"
      },
      {
        "name": "Oscar P. Pinto"
      },
      {
        "name": "Rajesh Shah"
      },
      {
        "name": "Bruce Schlobohm"
      }
    ],
    "date": {
      "year": 2007,
      "month": 3,
      "day": 20
    },
    "url": "https://patents.google.com/patent/US7194540",
    "assignees": [
      {
        "name": "Intel Corporation"
      }
    ]
  },
  {
    "title": "Retargeting of platform interrupts",
    "summary": "Systems, methods, and apparatus to retarget platform interrupts in a reconfigurable system. Some embodiments include identifying each processor of a multiprocessor system capable of processing Corrected Platform Error Interrupts, adding each processor capable of processing Corrected Platform Error Interrupts to a list of potential Corrected Platform Error Interrupt targets, and updating an interrupt table with a target processor for an interrupt, wherein the interrupt table is accessible by an interrupt controller to target platform interrupts. Another embodiment includes receiving a request to disable the first processor in a multiprocessor apparatus, determining if the first processor is a Corrected Platform Error Interrupt destination, and determining if the second processor is capable of processing Corrected Platform Error Interrupts. This embodiment also includes reprogramming an interrupt controller to route interrupts to the second processor instead of the first processor and disabling the first processor.",
    "number": "7447820",
    "status": "granted",
    "office": {
      "name": "United States Patent and Trademark Office (USPTO)"
    },
    "inventors": [
      {
        "name": "Ashok Raj"
      }
    ],
    "date": {
      "year": 2008,
      "month": 11,
      "day": 4
    },
    "url": "https://patents.google.com/patent/US7447820",
    "assignees": [
      {
        "name": "Intel Corporation"
      }
    ]
  },
  {
    "title": "I/O translation lookaside buffer performance",
    "summary": "Methods and apparatus to provide improved input/output (I/O) address translation lookaside buffer performance are described. In one embodiment, one or more entries of a cache (e.g., an I/O address translation lookaside buffer) are locked in response to a request to lock the one or more entries. Other embodiments are also described.",
    "number": "7636832",
    "status": "granted",
    "office": {
      "name": "United States Patent and Trademark Office (USPTO)"
    },
    "inventors": [
      {
        "name": "Ashok Raj"
      },
      {
        "name": "Rajesh Shah"
      }
    ],
    "date": {
      "year": 2009,
      "month": 12,
      "day": 22
    },
    "url": "https://patents.google.com/patent/US7636832",
    "assignees": [
      {
        "name": "Intel Corporation"
      }
    ]
  },
  {
    "title": "Mechanism for advanced server machine check recovery and associated system software enhancements",
    "summary": "Embodiments of a hardware processor including a plurality of machine state registers (MSRs) are described. At least one of the MSRs includes an erroring logical processing (ELP) bit which when set, indicates that a particular thread executing on the hardware processor caused an error.",
    "number": "8671309",
    "status": "granted",
    "office": {
      "name": "United States Patent and Trademark Office (USPTO)"
    },
    "inventors": [
      {
        "name": "Mohan J. Kumar"
      },
      {
        "name": "Ashok Raj"
      },
      {
        "name": "Theodros Yigzaw"
      },
      {
        "name": "Narayan Ranganathan"
      }
    ],
    "date": {
      "year": 2014,
      "month": 3,
      "day": 11
    },
    "url": "https://patents.google.com/patent/US8671309",
    "assignees": [
      {
        "name": "Intel Corporation"
      }
    ]
  },
  {
    "title": "Signaling software recoverable errors",
    "summary": "Embodiments of an invention for signaling software recoverable errors are disclosed. In one embodiment, a processor includes a first unit, a programmable indicator, and a second unit. The first unit is to detect a poison error. The programmable indicator is to indicate whether the poison error is signaled as a machine check error or as one of a fault and a system management interrupt. The second unit is to signal the poison error as one of a fault and a system management error responsive to the programmable indicator.",
    "number": "9141454",
    "status": "granted",
    "office": {
      "name": "United States Patent and Trademark Office (USPTO)"
    },
    "inventors": [
      {
        "name": "Gilbert Neiger"
      },
      {
        "name": "Rajesh M. Sankaran"
      },
      {
        "name": "Mohan J. Kumar"
      },
      {
        "name": "Ashok Raj"
      },
      {
        "name": "John G. Holm"
      }
    ],
    "date": {
      "year": 2015,
      "month": 9,
      "day": 22
    },
    "url": "https://patents.google.com/patent/US9141454",
    "assignees": [
      {
        "name": "Intel Corporation"
      }
    ]
  },
  {
    "title": "Allocating machine check architecture banks",
    "summary": "In accordance with embodiments disclosed herein, there is provided systems and methods for allocating machine check architecture banks. The processing device includes a plurality of machine check architecture banks to communicate a machine check error. The processing also includes an allocator to allocate during runtime of the processor a target machine check architecture bank of the plurality of machine check architecture banks. The runtime of the processor is during an occurrence of the machine check error.",
    "number": "9384076",
    "status": "granted",
    "office": {
      "name": "United States Patent and Trademark Office (USPTO)"
    },
    "inventors": [
      {
        "name": "Malini K. Bhandaru"
      },
      {
        "name": "Ashok Raj"
      },
      {
        "name": "William G. Auld"
      }
    ],
    "date": {
      "year": 2016,
      "month": 7,
      "day": 5
    },
    "url": "https://patents.google.com/patent/US9384076",
    "assignees": [
      {
        "name": "Intel Corporation"
      }
    ]
  },
  {
    "title": "Determine when an error log was created",
    "summary": "A computing system can include a machine check counter (MCC) including a current value. The current value indicates a system reboot resetting hardware of the computing system. The machine check counter includes a model specific register including a counter indicating the current value, the current value to be incremented upon the system reboot.",
    "number": "9389942",
    "status": "granted",
    "office": {
      "name": "United States Patent and Trademark Office (USPTO)"
    },
    "inventors": [
      {
        "name": "Ashok Raj"
      },
      {
        "name": "Narayan Ranganathan"
      }
    ],
    "date": {
      "year": 2016,
      "month": 7,
      "day": 12
    },
    "url": "https://patents.google.com/patent/US9389942",
    "assignees": [
      {
        "name": "Intel Corporation"
      }
    ]
  },
  {
    "title": "Exchange error information from platform firmware to operating system",
    "summary": "A computing system can include a platform firmware to monitor hardware errors and to notify an operating system when a corrective action is to be performed to address a hardware error. The computing system can also include an extended error log to describe a hardware error. The computing system can further include an action record to direct the operating system to perform the corrective action to address the hardware error.",
    "number": "9396059",
    "status": "granted",
    "office": {
      "name": "United States Patent and Trademark Office (USPTO)"
    },
    "inventors": [
      {
        "name": "Mohan J. Kumar"
      },
      {
        "name": "Ashok Raj"
      },
      {
        "name": "Narayan Ranganathan"
      }
    ],
    "date": {
      "year": 2016,
      "month": 7,
      "day": 19
    },
    "url": "https://patents.google.com/patent/US9396059",
    "assignees": [
      {
        "name": "Intel Corporation"
      }
    ]
  },
  {
    "title": "Hardware apparatuses and methods to check data storage devices for transient faults",
    "summary": "Methods and apparatuses relating to a hardware memory test unit to check a section of a data storage device for a transient fault before the data is stored in and/or loaded from the section of the data storage device are described. In one embodiment, an integrated circuit includes a hardware processor to operate on data in a section of a data storage device, and a memory test unit to check the section of the data storage device for a transient fault before the data is stored in the section of the data storage device, wherein the transient fault is to cause a machine check exception if accessed by the hardware processor.",
    "number": "9595349",
    "status": "granted",
    "office": {
      "name": "United States Patent and Trademark Office (USPTO)"
    },
    "inventors": [
      {
        "name": "Hisham Shafi"
      },
      {
        "name": "Mohan J. Kumar"
      },
      {
        "name": "Ron Gabor"
      },
      {
        "name": "Ashok Raj"
      },
      {
        "name": "Theodros Yigzaw"
      }
    ],
    "date": {
      "year": 2017,
      "month": 3,
      "day": 14
    },
    "url": "https://patents.google.com/patent/US9595349",
    "assignees": [
      {
        "name": "Intel Corporation"
      }
    ]
  },
  {
    "title": "Context based alert system",
    "summary": "An embodiment allows for context based alerts/alarms. For example, an embodiment may automatically determine that a user is in a meeting with another person based on a meeting entry in the user's calendar. In such a situation the embodiment may divert an incoming phone call, which would ordinarily result in a ring tone, to go directly to voice mail based on the calendar entry. In an embodiment the alert may be delayed until the meeting concludes. Unlike conventional systems, various embodiments do not require a user to change notification rules, manually flip a hardware switch, or create a Do Not Disturb setting that allows just a single silent time during the day. An embodiment allows data in a calendar to automatically drive the behavior of how a notification panel operates. Other embodiments are described herein.",
    "number": "9652747",
    "status": "granted",
    "office": {
      "name": "United States Patent and Trademark Office (USPTO)"
    },
    "inventors": [
      {
        "name": "Ashok Raj"
      }
    ],
    "date": {
      "year": 2017,
      "month": 5,
      "day": 16
    },
    "url": "https://patents.google.com/patent/US9652747",
    "assignees": [
      {
        "name": "Intel Corporation"
      }
    ]
  },
  {
    "title": "Instruction and logic for machine checking communication",
    "summary": "A processor includes a logic to determine an error condition reported in an error bank. The error bank is communicatively coupled to the processor and is associated with logical processors of the processor. The processor includes another logic to generate an interrupt indicating the error condition. The processor includes yet another logic to selectively send the interrupt to a single one of the logical processors associated with the error bank.",
    "number": "9842015",
    "status": "granted",
    "office": {
      "name": "United States Patent and Trademark Office (USPTO)"
    },
    "inventors": [
      {
        "name": "Mohan J. Kumar"
      },
      {
        "name": "James B. Crossland"
      },
      {
        "name": "Ashok Raj"
      },
      {
        "name": "Jose A. Vargas"
      },
      {
        "name": "Theodros Yigzaw"
      },
      {
        "name": "William G. Auld"
      },
      {
        "name": "Cameron McNairy"
      },
      {
        "name": "Anthony Luck"
      }
    ],
    "date": {
      "year": 2017,
      "month": 12,
      "day": 12
    },
    "url": "https://patents.google.com/patent/US9842015",
    "assignees": [
      {
        "name": "Intel Corporation"
      }
    ]
  },
  {
    "title": "Instruction and logic for machine check interrupt management",
    "summary": "A processor includes a front end including a decoder to decode an instruction, a scheduler to assign execution of the instruction to a core, and a core to execute the instruction. The instruction specifies that interrupts such as corrected machine check interrupts are to be selectively suppressed. The processor further includes an error handling unit including logic to determine that an interrupt caused by an error is to be created and that an error consumer has requested interrupt notification. The error handling unit further includes logic to, based on the instruction specifying that interrupts are to be selectively suppressed, send the interrupt to a producer that issued the instruction rather than the error consumer.",
    "number": "9864603",
    "status": "granted",
    "office": {
      "name": "United States Patent and Trademark Office (USPTO)"
    },
    "inventors": [
      {
        "name": "Mohan J. Kumar"
      },
      {
        "name": "Ashok Raj"
      }
    ],
    "date": {
      "year": 2018,
      "month": 1,
      "day": 9
    },
    "url": "https://patents.google.com/patent/US9864603",
    "assignees": [
      {
        "name": "Intel Corporation"
      }
    ]
  },
  {
    "title": "Interfacing with block-based storage in a processor",
    "summary": "In one embodiment, a processor includes a core having a fetch unit to fetch instructions, a decode unit to decode the instructions, and one or more execution units to execute the instructions. The core may further include: a first pair of block address range registers to store a start location and an end location of a block range within a non-volatile block storage coupled to the processor; and a block status storage to store an error indicator responsive to an occurrence of an error within the block range during a block operation. Other embodiments are described and claimed.",
    "number": "9904586",
    "status": "granted",
    "office": {
      "name": "United States Patent and Trademark Office (USPTO)"
    },
    "inventors": [
      {
        "name": "Hisham Shafi"
      },
      {
        "name": "Mohan J. Kumar"
      },
      {
        "name": "Ron Gabor"
      },
      {
        "name": "Ashok Raj"
      },
      {
        "name": "Theodros Yigzaw"
      }
    ],
    "date": {
      "year": 2018,
      "month": 2,
      "day": 27
    },
    "url": "https://patents.google.com/patent/US9904586",
    "assignees": [
      {
        "name": "Intel Corporation"
      }
    ]
  }
]