[
  {
    "title": "Utilization of non-volatile random access memory for information storage in response to error conditions",
    "summary": "Methods, apparatus, systems and articles of manufacture (e.g., physical storage media) to utilize non-volatile random access memory for information storage in response to error conditions are disclosed. Example methods disclosed herein include accessing, with a power control unit associated with a processor, first information describing available capacities of respective reserved regions of a plurality of non-volatile memory modules, the respective reserved regions of the non-volatile memory modules being separate from respective host-visible regions of the non-volatile memory modules. Disclosed example methods also include configuring, with the power control unit, an information storage architecture based on the first information. Disclosed example methods further include storing, with the power control unit, second information in one or more of the respective reserved regions of the non-volatile memory modules in accordance with the information storage architecture.",
    "number": "10157005",
    "status": "granted",
    "office": {
      "name": "United States Patent and Trademark Office (USPTO)"
    },
    "inventors": [
      {
        "name": "Robert C. Swanson"
      },
      {
        "name": "Theodros Yigzaw"
      },
      {
        "name": "Chris Ackles"
      },
      {
        "name": "Celeste M. Brown"
      },
      {
        "name": "Tony S. Baker"
      }
    ],
    "date": {
      "year": 2018,
      "month": 12,
      "day": 18
    },
    "url": "https://patents.google.com/patent/US10157005",
    "assignees": [
      {
        "name": "Intel Corporation"
      }
    ]
  },
  {
    "title": "Apparatus and method for system physical address to memory module address translation",
    "summary": "An apparatus and method are described for system physical address to memory module address translation. For example, one embodiment of an apparatus comprises: a fetch circuit of a core to fetch a system physical address (SPA) translate instruction from memory; a decode circuit of the core to decode the SPA translate instruction; a first register to store an SPA associated with the SPA translate instruction; a memory controller comprising one or more channel controllers to initiate a translation using the SPA, the memory controller to transmit a translation request to a first channel controller; the first channel controller to synthesize a response including dual in-line memory module (DIMM) address information; and a second register to store the DIMM address information to be used to identify the DIMM during subsequent memory transactions.",
    "number": "10162761",
    "status": "granted",
    "office": {
      "name": "United States Patent and Trademark Office (USPTO)"
    },
    "inventors": [
      {
        "name": "Mohan J. Kumar"
      },
      {
        "name": "Sarathy Jayakumar"
      },
      {
        "name": "Ashok Raj"
      },
      {
        "name": "Theodros Yigzaw"
      },
      {
        "name": "Ronald N. Story"
      },
      {
        "name": "Sreenivas Mandava"
      }
    ],
    "date": {
      "year": 2018,
      "month": 12,
      "day": 25
    },
    "url": "https://patents.google.com/patent/US10162761",
    "assignees": [
      {
        "name": "Intel Corporation"
      }
    ]
  },
  {
    "title": "Handling of error prone cache line slots of memory side cache of multi-level system memory",
    "summary": "An apparatus is described that includes memory controller logic circuitry to interface with a memory side cache of a multi-level system memory. The memory controller logic circuitry includes error tracking circuitry to track errors of cache line slots in the memory side cache. The memory controller logic circuitry also comprises faulty list circuitry to store identifiers of faulty cache line slots that are deemed to be excessively error prone. The memory controller logic circuitry is to declare a miss in the memory side cache for requests that map to cache line slots identified in the faulty list.",
    "number": "10185619",
    "status": "granted",
    "office": {
      "name": "United States Patent and Trademark Office (USPTO)"
    },
    "inventors": [
      {
        "name": "Mohan J. Kumar"
      },
      {
        "name": "Robert C. Swanson"
      },
      {
        "name": "Ashok Raj"
      },
      {
        "name": "Theodros Yigzaw"
      }
    ],
    "date": {
      "year": 2019,
      "month": 1,
      "day": 22
    },
    "url": "https://patents.google.com/patent/US10185619",
    "assignees": [
      {
        "name": "Intel Corporation"
      }
    ]
  },
  {
    "title": "Apparatus and method for detecting and recovering from data fetch errors",
    "summary": "An apparatus and method are described for detecting and correcting data fetch errors within a processor core. For example, one embodiment of an instruction processing apparatus for detecting and recovering from data fetch errors comprises: at least one processor core having a plurality of instruction processing stages including a data fetch stage and a retirement stage; and error processing logic in communication with the processing stages to perform the operations of: detecting an error associated with data in response to a data fetch operation performed by the data fetch stage; and responsively performing one or more operations to ensure that the error does not corrupt an architectural state of the processor core within the retirement stage.",
    "number": "10223204",
    "status": "granted",
    "office": {
      "name": "United States Patent and Trademark Office (USPTO)"
    },
    "inventors": [
      {
        "name": "Hisham Shafi"
      },
      {
        "name": "Mohan J. Kumar"
      },
      {
        "name": "Shlomo Raikin"
      },
      {
        "name": "Ganapati Srinivasa"
      },
      {
        "name": "Ehud Cohen"
      },
      {
        "name": "Zeev Sperber"
      },
      {
        "name": "Jose A. Vargas"
      },
      {
        "name": "Michael Mishaeli"
      },
      {
        "name": "Theodros Yigzaw"
      },
      {
        "name": "Julius Mandelblat"
      },
      {
        "name": "Geeyarpuram N. Santhanakrishnan"
      }
    ],
    "date": {
      "year": 2019,
      "month": 3,
      "day": 5
    },
    "url": "https://patents.google.com/patent/US10223204",
    "assignees": [
      {
        "name": "Intel Corporation"
      }
    ]
  },
  {
    "title": "Read from memory instructions, processors, methods, and systems, that do not take exception on defective data",
    "summary": "A processor of an aspect includes a decode unit to decode a read from memory instruction. The read from memory instruction is to indicate a source memory operand and a destination storage location. The processor also includes an execution unit coupled with the decode unit. The execution unit, in response to the read from memory instruction, is to read data from the source memory operand, store an indication of defective data in an architecturally visible storage location, when the data is defective, and complete execution of the read from memory instruction without causing an exceptional condition, when the data is defective. Other processors, methods, systems, and instructions are disclosed.",
    "number": "10296416",
    "status": "granted",
    "office": {
      "name": "United States Patent and Trademark Office (USPTO)"
    },
    "inventors": [
      {
        "name": "Hisham Shafi"
      },
      {
        "name": "Mohan J. Kumar"
      },
      {
        "name": "Sarathy Jayakumar"
      },
      {
        "name": "Ron Gabor"
      },
      {
        "name": "Sergiu D. Ghetie"
      },
      {
        "name": "Ashok Raj"
      },
      {
        "name": "Theodros Yigzaw"
      },
      {
        "name": "Neeraj Upasani"
      }
    ],
    "date": {
      "year": 2019,
      "month": 5,
      "day": 21
    },
    "url": "https://patents.google.com/patent/US10296416",
    "assignees": [
      {
        "name": "Intel Corporation"
      }
    ]
  },
  {
    "title": "Enabling error status and reporting in a machine check architecture",
    "summary": "In accordance with implementations disclosed herein, there is provided systems and methods for enabling error status and reporting in a machine check environment. A processing device includes an error status register and an error status component communicably coupled to the error status register. The error status component determines that a machine check error (MCE) is a first correctable error (CE) and sets a first error status corresponding to the first CE in the error status register based on a threshold value. The threshold value is based on a type of the first CE.",
    "number": "10318368",
    "status": "granted",
    "office": {
      "name": "United States Patent and Trademark Office (USPTO)"
    },
    "inventors": [
      {
        "name": "Ashok Raj"
      },
      {
        "name": "Theodros Yigzaw"
      }
    ],
    "date": {
      "year": 2019,
      "month": 6,
      "day": 11
    },
    "url": "https://patents.google.com/patent/US10318368",
    "assignees": [
      {
        "name": "Intel Corporation"
      }
    ]
  },
  {
    "title": "Hardware apparatuses and methods to check data storage devices for transient faults",
    "summary": "Methods and apparatuses relating to a hardware memory test unit to check a section of a data storage device for a transient fault before the data is stored in and/or loaded from the section of the data storage device are described. In one embodiment, an integrated circuit includes a hardware processor to operate on data in a section of a data storage device, and a memory test unit to check the section of the data storage device for a transient fault before the data is stored in the section of the data storage device, wherein the transient fault is to cause a machine check exception if accessed by the hardware processor.",
    "number": "10319458",
    "status": "granted",
    "office": {
      "name": "United States Patent and Trademark Office (USPTO)"
    },
    "inventors": [
      {
        "name": "Hisham Shafi"
      },
      {
        "name": "Mohan J. Kumar"
      },
      {
        "name": "Ron Gabor"
      },
      {
        "name": "Ashok Raj"
      },
      {
        "name": "Theodros Yigzaw"
      }
    ],
    "date": {
      "year": 2019,
      "month": 6,
      "day": 11
    },
    "url": "https://patents.google.com/patent/US10319458",
    "assignees": [
      {
        "name": "Intel Corporation"
      }
    ]
  },
  {
    "title": "System and method to increase availability in a multi-level memory configuration",
    "summary": "One embodiment provides for a data processing system comprising a multi-level system memory including a first memory level of volatile memory and a second memory level that is larger and slower in comparison with the first memory level. The second memory level includes non-volatile memory and can additionally include volatile memory. The multi-level system memory includes a multi-level memory controller including logic to manage a list of faulty addresses within the multi-level system memory. The multi-level memory controller can manage a list of faulty addresses. The multi-level memory controller is configured to satisfy a request for data stored in the first memory level from the second memory level when the data is stored in an address on the list of faulty addresses.",
    "number": "10324852",
    "status": "granted",
    "office": {
      "name": "United States Patent and Trademark Office (USPTO)"
    },
    "inventors": [
      {
        "name": "Mohan J. Kumar"
      },
      {
        "name": "Robert C. Swanson"
      },
      {
        "name": "Ashok Raj"
      },
      {
        "name": "Theodros Yigzaw"
      }
    ],
    "date": {
      "year": 2019,
      "month": 6,
      "day": 18
    },
    "url": "https://patents.google.com/patent/US10324852",
    "assignees": [
      {
        "name": "Intel Corporation"
      }
    ]
  },
  {
    "title": "Delayed error processing",
    "summary": "A computing apparatus, including: a hardware platform including a processor and memory; and a system management interrupt (SMI) handler; first logic configured to provide a first container and a second container via the hardware platform; and second logic configured to: detect an uncorrectable error in the first container; responsive to the detecting, generate a degraded system state; provide a degraded state message to the SMI handler; instruct the second container to seek a recoverable state; determine that the second container has entered a recoverable state; and initiate a recovery operation.",
    "number": "10929232",
    "status": "granted",
    "office": {
      "name": "United States Patent and Trademark Office (USPTO)"
    },
    "inventors": [
      {
        "name": "Sarathy Jayakumar"
      },
      {
        "name": "Gaurav Porwal"
      },
      {
        "name": "Subhankar Panda"
      },
      {
        "name": "Theodros Yigzaw"
      }
    ],
    "date": {
      "year": 2021,
      "month": 2,
      "day": 23
    },
    "url": "https://patents.google.com/patent/US10929232",
    "assignees": [
      {
        "name": "Intel Corporation"
      }
    ]
  },
  {
    "title": "Apparatus and method for detecting and recovering from data fetch errors",
    "summary": "An apparatus and method are described for detecting and correcting data fetch errors within a processor core. For example, one embodiment of an instruction processing apparatus for detecting and recovering from data fetch errors comprises: at least one processor core having a plurality of instruction processing stages including a data fetch stage and a retirement stage; and error processing logic in communication with the processing stages to perform the operations of: detecting an error associated with data in response to a data fetch operation performed by the data fetch stage; and responsively performing one or more operations to ensure that the error does not corrupt an architectural state of the processor core within the retirement stage.",
    "number": "11048587",
    "status": "granted",
    "office": {
      "name": "United States Patent and Trademark Office (USPTO)"
    },
    "inventors": [
      {
        "name": "Hisham Shafi"
      },
      {
        "name": "Mohan J. Kumar"
      },
      {
        "name": "Shlomo Raikin"
      },
      {
        "name": "Ganapati Srinivasa"
      },
      {
        "name": "Ehud Cohen"
      },
      {
        "name": "Zeev Sperber"
      },
      {
        "name": "Jose A. Vargas"
      },
      {
        "name": "Michael Mishaeli"
      },
      {
        "name": "Theodros Yigzaw"
      },
      {
        "name": "Julius Mandelblat"
      },
      {
        "name": "Geeyarpuram N. Santhanakrishnan"
      }
    ],
    "date": {
      "year": 2021,
      "month": 6,
      "day": 29
    },
    "url": "https://patents.google.com/patent/US11048587",
    "assignees": [
      {
        "name": "Intel Corporation"
      }
    ]
  },
  {
    "title": "Read from memory instructions, processors, methods, and systems, that do not take exception on defective data",
    "summary": "A processor of an aspect includes a decode unit to decode a read from memory instruction. The read from memory instruction is to indicate a source memory operand and a destination storage location. The processor also includes an execution unit coupled with the decode unit. The execution unit, in response to the read from memory instruction, is to read data from the source memory operand, store an indication of defective data in an architecturally visible storage location, when the data is defective, and complete execution of the read from memory instruction without causing an exceptional condition, when the data is defective. Other processors, methods, systems, and instructions are disclosed.",
    "number": "11068339",
    "status": "granted",
    "office": {
      "name": "United States Patent and Trademark Office (USPTO)"
    },
    "inventors": [
      {
        "name": "Hisham Shafi"
      },
      {
        "name": "Mohan J. Kumar"
      },
      {
        "name": "Sarathy Jayakumar"
      },
      {
        "name": "Ron Gabor"
      },
      {
        "name": "Sergiu D. Ghetie"
      },
      {
        "name": "Ashok Raj"
      },
      {
        "name": "Theodros Yigzaw"
      },
      {
        "name": "Neeraj Upasani"
      }
    ],
    "date": {
      "year": 2021,
      "month": 7,
      "day": 20
    },
    "url": "https://patents.google.com/patent/US11068339",
    "assignees": [
      {
        "name": "Intel Corporation"
      }
    ]
  },
  {
    "title": "System, apparatus and method for memory mirroring in a buffered memory architecture",
    "summary": "In one embodiment, an apparatus includes: a first memory controller to control access to a first memory, the first memory controller including a memory mirroring circuit, in response to a memory write request from a first processor socket for which the first memory comprises a primary memory region, to cause data associated with the memory write request to be written to the first memory and to send a shadow memory write request to a second memory to cause the second memory to write the data into a secondary memory region; and a shadow memory table including a plurality of entries each to store an association between a primary memory region and a secondary memory region. The memory mirroring circuit may access the shadow memory table to identify the secondary memory region. Other embodiments are described and claimed.",
    "number": "11182313",
    "status": "granted",
    "office": {
      "name": "United States Patent and Trademark Office (USPTO)"
    },
    "inventors": [
      {
        "name": "Ishwar Agarwal"
      },
      {
        "name": "Theodros Yigzaw"
      }
    ],
    "date": {
      "year": 2021,
      "month": 11,
      "day": 23
    },
    "url": "https://patents.google.com/patent/US11182313",
    "assignees": [
      {
        "name": "Intel Corporation"
      }
    ]
  },
  {
    "title": "Hardware unit for reverse translation in a processor",
    "summary": "In an embodiment, a processor for reverse translation includes a plurality of processing engines (PEs) to execute threads and a reverse translation circuit. The reverse translation circuit is to: determine a target module address of a corrupt portion of a memory module; determine a plurality of system physical address (SPA) addresses associated with the memory module; and for each SPA address in the plurality of SPA addresses, translate the SPA address into a translated module address, and in response to a determination that the translated module address matches the target module address, log the SPA address as a result of a reverse translation of the target module address. Other embodiments are described and claimed.",
    "number": "11307996",
    "status": "granted",
    "office": {
      "name": "United States Patent and Trademark Office (USPTO)"
    },
    "inventors": [
      {
        "name": "Sarathy Jayakumar"
      },
      {
        "name": "Wei-Pin Chen"
      },
      {
        "name": "Ashok Raj"
      },
      {
        "name": "Theodros Yigzaw"
      },
      {
        "name": "John G. Holm"
      }
    ],
    "date": {
      "year": 2022,
      "month": 4,
      "day": 19
    },
    "url": "https://patents.google.com/patent/US11307996",
    "assignees": [
      {
        "name": "Intel Corporation"
      }
    ]
  },
  {
    "title": "Device, system, and method to concurrently store multiple PMON counts in a single register",
    "summary": "Techniques and mechanisms for providing performance monitoring information. In an embodiment, a performance monitor circuit receives a communication which indicates a format comprising multiple fields which are each to store a respective count of monitored events. A programming of the performance monitor circuit, based on the communication, designates first bits and second bits of the register to provide, respectively, a first first field and a second field according to the format. Performance monitoring subsequent to the programming successively tallies a first count of first events which occur during a first period of time, and a second count of second events which occur during a second period of time. In another embodiment, performance monitoring results in the register concurrently storing both the first count and the second count.",
    "number": "12044730",
    "status": "granted",
    "office": {
      "name": "United States Patent and Trademark Office (USPTO)"
    },
    "inventors": [
      {
        "name": "Gaurav Porwal"
      },
      {
        "name": "Subhankar Panda"
      },
      {
        "name": "Theodros Yigzaw"
      },
      {
        "name": "John G. Holm"
      }
    ],
    "date": {
      "year": 2024,
      "month": 7,
      "day": 23
    },
    "url": "https://patents.google.com/patent/US12044730",
    "assignees": [
      {
        "name": "Intel Corporation"
      }
    ]
  },
  {
    "title": "Cloud scale server reliability management",
    "summary": "An embodiment of an electronic apparatus may comprise one or more substrates, and a controller coupled to the one or more substrates, the controller including circuitry to provide management of a connected hardware subsystem with respect to one or more of reliability, availability and serviceability, and coordinate the management of the connected hardware subsystem with respect to one or more of reliability, availability and serviceability between the connected hardware subsystem and a host. Other embodiments are disclosed and claimed.",
    "number": "12189468",
    "status": "granted",
    "office": {
      "name": "United States Patent and Trademark Office (USPTO)"
    },
    "inventors": [
      {
        "name": "Subhankar Panda"
      },
      {
        "name": "Theodros Yigzaw"
      },
      {
        "name": "John G. Holm"
      },
      {
        "name": "Guarav Porwal"
      },
      {
        "name": "Omar Avelar Suarez"
      },
      {
        "name": "Satyaprakash Nanda"
      },
      {
        "name": "Hugo Enrique Gonzalez Chavero"
      }
    ],
    "date": {
      "year": 2025,
      "month": 1,
      "day": 7
    },
    "url": "https://patents.google.com/patent/US12189468",
    "assignees": [
      {
        "name": "Intel Corporation"
      }
    ]
  },
  {
    "title": "Apparatus and method for detecting and recovering from data fetch errors",
    "summary": "An apparatus and method are described for detecting and correcting data fetch errors within a processor core. For example, one embodiment of an instruction processing apparatus for detecting and recovering from data fetch errors comprises: at least one processor core having a plurality of instruction processing stages including a data fetch stage and a retirement stage; and error processing logic in communication with the processing stages to perform the operations of: detecting an error associated with data in response to a data fetch operation performed by the data fetch stage; and responsively performing one or more operations to ensure that the error does not corrupt an architectural state of the processor core within the retirement stage.",
    "number": "12189479",
    "status": "granted",
    "office": {
      "name": "United States Patent and Trademark Office (USPTO)"
    },
    "inventors": [
      {
        "name": "Hisham Shafi"
      },
      {
        "name": "Mohan J. Kumar"
      },
      {
        "name": "Shlomo Raikin"
      },
      {
        "name": "Ganapati Srinivasa"
      },
      {
        "name": "Ehud Cohen"
      },
      {
        "name": "Zeev Sperber"
      },
      {
        "name": "Jose A. Vargas"
      },
      {
        "name": "Michael Mishaeli"
      },
      {
        "name": "Theodros Yigzaw"
      },
      {
        "name": "Julius Mandelblat"
      },
      {
        "name": "Geeyarpuram N. Santhanakrishnan"
      }
    ],
    "date": {
      "year": 2025,
      "month": 1,
      "day": 7
    },
    "url": "https://patents.google.com/patent/US12189479",
    "assignees": [
      {
        "name": "Intel Corporation"
      }
    ]
  },
  {
    "title": "Adaptive error correction to improve system memory reliability, availability, and serviceability (RAS)",
    "summary": "A memory subsystem includes memory devices with space dynamically allocated for improvement of reliability, availability, and serviceability (RAS) in the system. Error checking and correction (ECC) logic detects an error in all or a portion of a memory device. In response to error detection, the system can dynamically perform one or more of: allocate active memory device space for sparing to spare a failed memory segment; write a poison pattern into a failed cacheline to mark it as failed; perform permanent fault detection (PFD) and adjust application of ECC based on PFD detection; or, spare only a portion of a device and leave another portion active, including adjusting ECC based on the spared portion. The error detection can be based on bits of an ECC device, and error correction based on those bits and additional bits stored on the data devices.",
    "number": "12235720",
    "status": "granted",
    "office": {
      "name": "United States Patent and Trademark Office (USPTO)"
    },
    "inventors": [
      {
        "name": "Kuljit S. Bains"
      },
      {
        "name": "Jing Ling"
      },
      {
        "name": "Wei-Pin Chen"
      },
      {
        "name": "Wei Wu"
      },
      {
        "name": "Rajat Agarwal"
      },
      {
        "name": "Vaibhav Singh"
      },
      {
        "name": "Andrew M. Rudoff"
      },
      {
        "name": "Deep Buch"
      },
      {
        "name": "Theodros Yigzaw"
      },
      {
        "name": "John G. Holm"
      },
      {
        "name": "Kjersten E. Criss"
      },
      {
        "name": "Sreenivas Mandava"
      },
      {
        "name": "Hsing-Min Chen"
      }
    ],
    "date": {
      "year": 2025,
      "month": 2,
      "day": 25
    },
    "url": "https://patents.google.com/patent/US12235720",
    "assignees": [
      {
        "name": "Intel Corporation"
      }
    ]
  },
  {
    "title": "Performance prioritization in multi-threaded processors",
    "summary": "According to one embodiment of the invention, a method is disclosed for selecting a first subset of a plurality of cache ways in a cache for storing hardware threads identified as high priority hardware threads for processing by a multi-threaded processor in communication with the cache; assigning high priority hardware threads to the selected first subset; monitoring a cache usage of a high priority hardware thread assigned to the selected first subset of plurality of cache ways; and reassigning the assigned high priority hardware thread to any cache way of the plurality of cache ways if the cache usage of the high priority hardware thread exceeds a predetermined inactive cache usage threshold value based on the monitoring.",
    "number": "8275942",
    "status": "granted",
    "office": {
      "name": "United States Patent and Trademark Office (USPTO)"
    },
    "inventors": [
      {
        "name": "Ganapati Srinivasa"
      },
      {
        "name": "Mark Rowland"
      },
      {
        "name": "Theodros Yigzaw"
      },
      {
        "name": "Geeyarpuram N. Santhanakrishnan"
      }
    ],
    "date": {
      "year": 2012,
      "month": 9,
      "day": 25
    },
    "url": "https://patents.google.com/patent/US8275942",
    "assignees": [
      {
        "name": "Intel Corporation"
      }
    ]
  },
  {
    "title": "Injecting a data error into a writeback path to memory",
    "summary": "In one embodiment, a processor includes error injection circuitry separate and independent of debug circuitry of the processor. This circuitry can be used by a software developer to seed errors into a write-back path to system memory to emulate errors for purposes of validation of error recovery code of the software. The circuitry can include a register to store an address within the system memory at which an error is to be injected, a detection logic to detect when an instruction associated with the address is issued, and injection logic to cause the error to be injected into the address within the system memory responsive to the detection of the instruction. Other embodiments are described and claimed.",
    "number": "8645797",
    "status": "granted",
    "office": {
      "name": "United States Patent and Trademark Office (USPTO)"
    },
    "inventors": [
      {
        "name": "Mohan J. Kumar"
      },
      {
        "name": "Yen-Cheng Liu"
      },
      {
        "name": "Jose A. Vargas"
      },
      {
        "name": "Theodros Yigzaw"
      }
    ],
    "date": {
      "year": 2014,
      "month": 2,
      "day": 4
    },
    "url": "https://patents.google.com/patent/US8645797",
    "assignees": [
      {
        "name": "Intel Corporation"
      }
    ]
  },
  {
    "title": "Mechanism for advanced server machine check recovery and associated system software enhancements",
    "summary": "Embodiments of a hardware processor including a plurality of machine state registers (MSRs) are described. At least one of the MSRs includes an erroring logical processing (ELP) bit which when set, indicates that a particular thread executing on the hardware processor caused an error.",
    "number": "8671309",
    "status": "granted",
    "office": {
      "name": "United States Patent and Trademark Office (USPTO)"
    },
    "inventors": [
      {
        "name": "Mohan J. Kumar"
      },
      {
        "name": "Ashok Raj"
      },
      {
        "name": "Theodros Yigzaw"
      },
      {
        "name": "Narayan Ranganathan"
      }
    ],
    "date": {
      "year": 2014,
      "month": 3,
      "day": 11
    },
    "url": "https://patents.google.com/patent/US8671309",
    "assignees": [
      {
        "name": "Intel Corporation"
      }
    ]
  },
  {
    "title": "Machine check summary register",
    "summary": "In some implementations, a processor may include a machine check architecture having a plurality of error reporting registers able to receive data for machine check errors. A summary register may include a plurality of settable locations that each represents at least one of the error reporting registers. One or more of the settable locations in the summary register may be set to indicate whether one or more of the error reporting registers maintain data for a machine check error. Accordingly, when a machine check error occurs, the summary register may be accessed to identify if any error reporting registers in a processor's view contain valid error data, rather than having to read each of the error reporting registers in the processor's view.",
    "number": "9317360",
    "status": "granted",
    "office": {
      "name": "United States Patent and Trademark Office (USPTO)"
    },
    "inventors": [
      {
        "name": "Mohan J. Kumar"
      },
      {
        "name": "James B. Crossland"
      },
      {
        "name": "Murugasamy K. Nachimuthu"
      },
      {
        "name": "Jose A. Vargas"
      },
      {
        "name": "Theodros Yigzaw"
      }
    ],
    "date": {
      "year": 2016,
      "month": 4,
      "day": 19
    },
    "url": "https://patents.google.com/patent/US9317360",
    "assignees": [
      {
        "name": "Intel Corporation"
      }
    ]
  },
  {
    "title": "Secure error handling",
    "summary": "Various embodiments are described herein. Some embodiments include an Operating System and a platform. The platform includes a processor having an error register. The Operating System can write to the error register only via the platform in a secure manner (for example, using platform firmware). Other embodiments are described and claimed.",
    "number": "9342394",
    "status": "granted",
    "office": {
      "name": "United States Patent and Trademark Office (USPTO)"
    },
    "inventors": [
      {
        "name": "Mohan J. Kumar"
      },
      {
        "name": "Murugasamy K. Nachimuthu"
      },
      {
        "name": "Jose A. Vargas"
      },
      {
        "name": "Theodros Yigzaw"
      },
      {
        "name": "Rajender Kuramkote"
      }
    ],
    "date": {
      "year": 2016,
      "month": 5,
      "day": 17
    },
    "url": "https://patents.google.com/patent/US9342394",
    "assignees": [
      {
        "name": "Intel Corporation"
      }
    ]
  },
  {
    "title": "Apparatus and method for implement a multi-level memory hierarchy",
    "summary": "An apparatus and method are described for detecting and correcting instruction fetch errors within a processor core. For example, in one embodiment, an instruction processing apparatus for detecting and recovering from instruction fetch errors comprises, the instruction processing apparatus performing the operations of: detecting an error associated with an instruction in response to an instruction fetch operation; and determining if the instruction is from a speculative access, wherein if the instruction is not from a speculative access, then responsively performing one or more operations to ensure that the error does not corrupt an architectural state of the processor core.",
    "number": "9448879",
    "status": "granted",
    "office": {
      "name": "United States Patent and Trademark Office (USPTO)"
    },
    "inventors": [
      {
        "name": "Hisham Shafi"
      },
      {
        "name": "Mohan J. Kumar"
      },
      {
        "name": "Larisa Novakovsky"
      },
      {
        "name": "Ganapati Srinivasa"
      },
      {
        "name": "Lihu Rappoport"
      },
      {
        "name": "Jose A. Vargas"
      },
      {
        "name": "Michael Mishaeli"
      },
      {
        "name": "Theodros Yigzaw"
      },
      {
        "name": "Julius Mandelblat"
      },
      {
        "name": "Oded Lempel"
      },
      {
        "name": "Chen Koren"
      },
      {
        "name": "Geeyarpuram N. Santhanakrishnan"
      }
    ],
    "date": {
      "year": 2016,
      "month": 9,
      "day": 20
    },
    "url": "https://patents.google.com/patent/US9448879",
    "assignees": [
      {
        "name": "Intel Corporation"
      }
    ]
  },
  {
    "title": "Hardware apparatuses and methods to check data storage devices for transient faults",
    "summary": "Methods and apparatuses relating to a hardware memory test unit to check a section of a data storage device for a transient fault before the data is stored in and/or loaded from the section of the data storage device are described. In one embodiment, an integrated circuit includes a hardware processor to operate on data in a section of a data storage device, and a memory test unit to check the section of the data storage device for a transient fault before the data is stored in the section of the data storage device, wherein the transient fault is to cause a machine check exception if accessed by the hardware processor.",
    "number": "9595349",
    "status": "granted",
    "office": {
      "name": "United States Patent and Trademark Office (USPTO)"
    },
    "inventors": [
      {
        "name": "Hisham Shafi"
      },
      {
        "name": "Mohan J. Kumar"
      },
      {
        "name": "Ron Gabor"
      },
      {
        "name": "Ashok Raj"
      },
      {
        "name": "Theodros Yigzaw"
      }
    ],
    "date": {
      "year": 2017,
      "month": 3,
      "day": 14
    },
    "url": "https://patents.google.com/patent/US9595349",
    "assignees": [
      {
        "name": "Intel Corporation"
      }
    ]
  },
  {
    "title": "Recovery from multiple data errors",
    "summary": "Mechanisms for handling multiple data errors that occur simultaneously are provided. A processing device may determine whether multiple data errors occur in memory locations that are within a range of memory locations. If the multiple memory locations are within the range of memory locations, the processing device may continue with a recovery process. If one of the multiple memory locations is outside of the range of memory locations, the processing device may halt the recovery process.",
    "number": "9690640",
    "status": "granted",
    "office": {
      "name": "United States Patent and Trademark Office (USPTO)"
    },
    "inventors": [
      {
        "name": "Stanislav Shwartsman"
      },
      {
        "name": "Raanan Sade"
      },
      {
        "name": "Ron Gabor"
      },
      {
        "name": "Deep Buch"
      },
      {
        "name": "Theodros Yigzaw"
      }
    ],
    "date": {
      "year": 2017,
      "month": 6,
      "day": 27
    },
    "url": "https://patents.google.com/patent/US9690640",
    "assignees": [
      {
        "name": "Intel Corporation"
      }
    ]
  },
  {
    "title": "Method to increase cloud availability and silicon isolation using secure enclaves",
    "summary": "Methods and apparatus to increase cloud availability and silicon isolation using secure enclaves. A compute platform is configured to host a compute domain in which a plurality of secure enclaves are implemented. In conjunction with creating and deploying secure enclaves, mapping information is generated that maps the secure enclaves to platform/CPU resources, such as Intellectual Property blocks (IP) belong to the secure enclaves. In response to platform error events caused by errant platform/CPU resources, the secure enclave(s) belonging to the errant platform/CPU are identified via the mapping information, and an interrupt is directed to that/those secure enclave(s). In response to the interrupt, a secure enclave may be configured to one or more of handle the error, pass information to another secure enclave, and teardown the enclave. The secure enclave may execute an interrupt service routine that causes the errant platform/CPU resource to reset without resetting the entire platform or CPU, as applicable.",
    "number": "9798641",
    "status": "granted",
    "office": {
      "name": "United States Patent and Trademark Office (USPTO)"
    },
    "inventors": [
      {
        "name": "Vincent J. Zimmer"
      },
      {
        "name": "Raghunandan Makaram"
      },
      {
        "name": "Robert C. Swanson"
      },
      {
        "name": "Eswaramoorthi Nallusamy"
      },
      {
        "name": "Theodros Yigzaw"
      }
    ],
    "date": {
      "year": 2017,
      "month": 10,
      "day": 24
    },
    "url": "https://patents.google.com/patent/US9798641",
    "assignees": [
      {
        "name": "Intel Corporation"
      }
    ]
  },
  {
    "title": "Clearing poison status on read accesses to volatile memory regions allocated in non-volatile memory",
    "summary": "Systems and methods may provide for detecting that a read operation is directed to a memory region while the memory region is in a poisoned state and clearing the poisoned state if volatile data stored in the memory region does not correspond to a known data pattern. Additionally, the memory region may be maintained in the poisoned state if the volatile data stored in the memory region corresponds to the known data pattern. In one example, an error may be detected, wherein the error is associated with a write operation directed to the memory region. In such a case, the poisoned state may be set for the volatile data in response to the error and the known data pattern may be written to the memory region.",
    "number": "9817738",
    "status": "granted",
    "office": {
      "name": "United States Patent and Trademark Office (USPTO)"
    },
    "inventors": [
      {
        "name": "Raj K. Ramanujan"
      },
      {
        "name": "Richard P. Mangold"
      },
      {
        "name": "Camille C. Raad"
      },
      {
        "name": "Theodros Yigzaw"
      }
    ],
    "date": {
      "year": 2017,
      "month": 11,
      "day": 14
    },
    "url": "https://patents.google.com/patent/US9817738",
    "assignees": [
      {
        "name": "Intel Corporation"
      }
    ]
  },
  {
    "title": "Instruction and logic for machine checking communication",
    "summary": "A processor includes a logic to determine an error condition reported in an error bank. The error bank is communicatively coupled to the processor and is associated with logical processors of the processor. The processor includes another logic to generate an interrupt indicating the error condition. The processor includes yet another logic to selectively send the interrupt to a single one of the logical processors associated with the error bank.",
    "number": "9842015",
    "status": "granted",
    "office": {
      "name": "United States Patent and Trademark Office (USPTO)"
    },
    "inventors": [
      {
        "name": "Mohan J. Kumar"
      },
      {
        "name": "James B. Crossland"
      },
      {
        "name": "Ashok Raj"
      },
      {
        "name": "Jose A. Vargas"
      },
      {
        "name": "Theodros Yigzaw"
      },
      {
        "name": "William G. Auld"
      },
      {
        "name": "Cameron McNairy"
      },
      {
        "name": "Anthony Luck"
      }
    ],
    "date": {
      "year": 2017,
      "month": 12,
      "day": 12
    },
    "url": "https://patents.google.com/patent/US9842015",
    "assignees": [
      {
        "name": "Intel Corporation"
      }
    ]
  },
  {
    "title": "Interfacing with block-based storage in a processor",
    "summary": "In one embodiment, a processor includes a core having a fetch unit to fetch instructions, a decode unit to decode the instructions, and one or more execution units to execute the instructions. The core may further include: a first pair of block address range registers to store a start location and an end location of a block range within a non-volatile block storage coupled to the processor; and a block status storage to store an error indicator responsive to an occurrence of an error within the block range during a block operation. Other embodiments are described and claimed.",
    "number": "9904586",
    "status": "granted",
    "office": {
      "name": "United States Patent and Trademark Office (USPTO)"
    },
    "inventors": [
      {
        "name": "Hisham Shafi"
      },
      {
        "name": "Mohan J. Kumar"
      },
      {
        "name": "Ron Gabor"
      },
      {
        "name": "Ashok Raj"
      },
      {
        "name": "Theodros Yigzaw"
      }
    ],
    "date": {
      "year": 2018,
      "month": 2,
      "day": 27
    },
    "url": "https://patents.google.com/patent/US9904586",
    "assignees": [
      {
        "name": "Intel Corporation"
      }
    ]
  }
]